profiling/results/stage-5_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.136ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.178ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18ms    1.29ms  23.73ms   89.12%
    Req/Sec   528.55    121.64     1.22k    73.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.92ms
 75.000%    2.55ms
 90.000%    3.23ms
 99.000%    7.82ms
 99.900%   12.90ms
 99.990%   18.09ms
 99.999%   23.74ms
100.000%   23.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.362     0.000000            1         0.00
       1.125     0.100000         4998 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.350     0.200000         9994         0.00
       1.543     0.300000        15009        -0.00
       1.730     0.400000        20013        -0.00
       1.923     0.500000        25001         0.00
       2.028     0.550000        27497 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.149     0.600000        30016         0.00
       2.273     0.650000        32498        -0.00
       2.401     0.700000        34985        -0.00
       2.545     0.750000        37479         0.00
       2.625     0.775000        38726 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.715     0.800000        40002         0.00
       2.809     0.825000        41231        -0.00
       2.919     0.850000        42484        -0.00
       3.051     0.875000        43723         0.00
       3.135     0.887500        44348 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       3.231     0.900000        44972         0.00
       3.343     0.912500        45601        -0.00
       3.491     0.925000        46224        -0.00
       3.703     0.937500        46845         0.00
       3.837     0.943750        47156 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       4.021     0.950000        47468         -nan
       4.235     0.956250        47781        -0.00
       4.503     0.962500        48091        -0.00
       4.939     0.968750        48405         0.00
       5.203     0.971875        48562 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       5.527     0.975000        48715         -nan
       5.875     0.978125        48872        -0.00
       6.319     0.981250        49029        -0.00
       6.735     0.984375        49184         0.00
       6.987     0.985938        49264 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       7.331     0.987500        49342         0.00
       7.623     0.989062        49419        -0.00
       8.039     0.990625        49497        -0.00
       8.527     0.992188        49574         0.00
       8.871     0.992969        49613 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
       9.151     0.993750        49652         0.00
       9.551     0.994531        49692        -0.00
       9.895     0.995313        49731        -0.00
      10.255     0.996094        49769         0.00
      10.639     0.996484        49789 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      10.935     0.996875        49808         -nan
      11.175     0.997266        49828        -0.00
      11.495     0.997656        49847        -0.00
      11.831     0.998047        49867         0.00
      11.967     0.998242        49877 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      12.119     0.998437        49886         -nan
      12.343     0.998633        49896        -0.00
      12.567     0.998828        49906        -0.00
      13.087     0.999023        49917         0.00
      13.231     0.999121        49921 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      13.447     0.999219        49925         0.00
      13.687     0.999316        49930        -0.00
      14.183     0.999414        49935        -0.00
      14.631     0.999512        49940         0.00
      14.799     0.999561        49943 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      14.967     0.999609        49945         0.00
      15.591     0.999658        49947        -0.00
      15.903     0.999707        49950        -0.00
      16.231     0.999756        49952         0.00
      16.623     0.999780        49954 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      17.071     0.999805        49955         -nan
      17.103     0.999829        49956        -0.00
      17.231     0.999854        49957        -0.00
      17.839     0.999878        49958         0.00
      18.095     0.999890        49959 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      18.527     0.999902        49960         -nan
      18.527     0.999915        49960        -0.00
      20.847     0.999927        49961        -0.00
      20.847     0.999939        49961         0.00
      22.223     0.999945        49962 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      22.223     0.999951        49962         0.00
      22.223     0.999957        49962        -0.00
      22.383     0.999963        49963        -0.00
      22.383     0.999969        49963         0.00
      22.383     0.999973        49963 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      22.383     0.999976        49963         0.00
      22.383     0.999979        49963        -0.00
      23.743     0.999982        49964        -0.00
      23.743     1.000000        49964         0.00
#[Mean    =        2.181, StdDeviation   =        1.291]
#[Max     =       23.728, Total count    =        49964]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59984 requests in 1.00m, 4.07MB read
  Non-2xx or 3xx responses: 15957
Requests/sec:    999.81
Transfer/sec:     69.55KB